nxp-mcuxpresso/mcux-sdk-examples/lpcxpresso55s69/azure_rtos_examples/i2c_example/cm33_core0/pin_mux.h
/*
 * Copyright 2017-2020 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define IOCON_PIO_DIGITAL_EN 0x0100u   /*!<@brief Enables digital function */
#define IOCON_PIO_ECS_DI 0x00u         /*!<@brief IO is an open drain cell */
#define IOCON_PIO_EGP_I2C 0x00u        /*!<@brief I2C mode */
#define IOCON_PIO_FUNC1 0x01u          /*!<@brief Selects pin function 1 */
#define IOCON_PIO_FUNC5 0x05u          /*!<@brief Selects pin function 5 */
#define IOCON_PIO_I2CFILTER_FAST 0x00u /*!<@brief I2C 50 ns glitch filter enabled */
#define IOCON_PIO_INPFILT_OFF 0x1000u  /*!<@brief Input filter disabled */
#define IOCON_PIO_INV_DI 0x00u         /*!<@brief Input function is not inverted */
#define IOCON_PIO_MODE_INACT 0x00u     /*!<@brief No addition pin function */
#define IOCON_PIO_OPENDRAIN_DI 0x00u   /*!<@brief Open drain is disabled */
#define IOCON_PIO_SLEW_STANDARD 0x00u  /*!<@brief Standard mode, output slew rate control is enabled */
#define IOCON_PIO_SSEL_3V3 0x00u       /*!<@brief 3V3 signaling in I2C mode */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
